cf_billing/Documents/энргУстановитьДатуПоверкиПУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьДатуПоверкиПУ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргДатыПоверкиПрибораУчета</xr:Item>
				<xr:Item>InformationRegister.энргПриборыУчетаСИстекшимСрокомПоверки</xr:Item>
				<xr:Item>InformationRegister.энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАдресОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоверкиСчетчика</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПредыдущейПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиВывод</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Флаг</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОчереднойПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияПредоставлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/энргСостояниеПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПриборовУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ввод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вывод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПоверке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргУстановитьДатуПоверкиПУ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
			
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргКарточкаАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Карточка абонента'");
	//КомандаОтчет.Порядок      						= 50;
	////КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
	////КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
	//КомандаОтчет.ФункциональныеОпции 				= "";	
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.Рассчитать;
	//
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргПредполагаемыеНачисленияАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Предполагаемые начисления'");
	//КомандаОтчет.Порядок      						= 50;
	////КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
	////КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
	//КомандаОтчет.ФункциональныеОпции 				= "";
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.ВидРасчета;
	
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 Булево - Ложь, функция не работает.
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Возврат Ложь;
	
КонецФункции

// Инициализирует данные документа.
//
// Параметры:
//  ДокументСсылка			-	ДокументСсылка.
//  ДополнительныеСвойства	-	Структура.
//  Регистры				-	Неопределено.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	Схема 				= Неопределено;
	
	ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема, Регистры);
	ДобавитьТекстЗапросаДатыПоверкиПрибораУчета(Схема, Регистры);
	ДобавитьТекстЗапросаСостояниеВыполненияОбязанностейГарантирующегоПоставщика(Схема, Регистры);
	ДобавитьТекстЗапросаПриборыУчетаСИстекшимСрокомПоверки(Схема, Регистры);
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	ДанныеСтроения			= ДополнительныеСвойства.ДанныеСтроения;
	КлючиТаблицДвижений 	= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	ПараметрыЗапроса 		= Новый Структура;
	ПараметрыЗапроса.Вставить("ЧастныйСектор"					, ДанныеСтроения.ЧастныйСектор);
	ПараметрыЗапроса.Вставить("Строение"						, ДанныеСтроения.Строение);
	ПараметрыЗапроса.Вставить("Помещение"						, ДанныеСтроения.Помещение);
	ПараметрыЗапроса.Вставить("мДокументы"						, ДокументСсылка);
	ПараметрыЗапроса.Вставить("ПустойУникальныйИдентификатор"	, ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
			
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

// Инициализирует таблицы для контроля.
//
// Параметры:
//  ДокументСсылка			-	ДокументСсылка.
//  ДополнительныеСвойства	-	Структура.
//
Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка,ДополнительныеСвойства) Экспорт 
	
	Схема  										= Неопределено;
	Параметры 									= Новый Структура;
	
	ДобавитьТекстЗапросаПараметрыКонтроля(Схема);	
	ДобавитьТекстЗапросаКонтрольСостояниеЛицевогоСчета(Схема);	
		
	КлючиТаблицКонтроля  						= Новый Структура;
			
	Для Сч = 0 По Схема.ПакетЗапросов.Количество() - 1  Цикл
		Пакет 									= Схема.ПакетЗапросов[Сч];		
		Если Не ПустаяСтрока(Пакет.ТаблицаДляПомещения) И СтрНачинаетсяС(Пакет.ТаблицаДляПомещения, "Контроль") Тогда			
			КлючиТаблицКонтроля.Вставить(Прав(Пакет.ТаблицаДляПомещения,СтрДлина(Пакет.ТаблицаДляПомещения) - СтрДлина("Контроль")),Сч);			
			Пакет.ТаблицаДляПомещения 			= "";
		КонецЕсли;		
	КонецЦикла;
	ТекстСообщенияЛицевойСчетЗакрыт 			= НСтр("ru = 'На дату операции лицевой счет закрыт'");
	ДанныеСтроения 								= ДополнительныеСвойства.ДанныеСтроения;
	
	ПараметрыЗапроса 							= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 						ДокументСсылка);
	ПараметрыЗапроса.Вставить("ЧастныйСектор",						ДанныеСтроения.ЧастныйСектор);
	ПараметрыЗапроса.Вставить("Строение", 							ДанныеСтроения.Строение);
	ПараметрыЗапроса.Вставить("Помещение",		 					ДанныеСтроения.Помещение);
	ПараметрыЗапроса.Вставить("ТекстСообщенияЛицевойСчетЗакрыт", 	ТекстСообщенияЛицевойСчетЗакрыт);
	
	ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 			энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 			КлючиТаблицКонтроля);
	
КонецПроцедуры

// Возвращает соответствие изменяемые параметры расчета.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ИзменяемыеПараметрыРасчета() Экспорт 
	
	ИзменяемыеПараметрыРасчета 	= Новый Соответствие; 
	
	ИзменяемыеПараметры 		= Новый Массив;	
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета","ДатаПоверки, ДатаРегистрацииПоверки"));	
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргУстановитьДатуПоверкиПУ_ИндивидуальныйВвод, ИзменяемыеПараметры);
	
	ИзменяемыеПараметры 		= Новый Массив;	
	ИзменяемыеПараметры.Добавить(Новый Структура("Ресурсы",""));	
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргУстановитьДатуПоверкиПУ_СвязанныеПомещения, ИзменяемыеПараметры);
	
	Возврат ИзменяемыеПараметрыРасчета;
	
КонецФункции

// Получает данные для проведения по стабильным периодам.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив.
//
Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема, ВыбираемыеТаблицы) Экспорт	
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовУстановитьДатуПоверкиПУ";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамУстановитьДатуПоверкиПУ());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса());				
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
	
	
	
	ИмяТаблицы 											= "ДанныеДокументовУстановитьДатуПоверкиПУСвязанныеПомещения";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамУстановитьДатуПоверкиПУСвязанныеПомещения());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса());				
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РеализацияИнтерефейса_Проведение

Процедура ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема, Регистры) 
	
	ИмяРегистра 	= "энргПоказанияПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;

	//Пакет 		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ТаблицаПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	0 КАК Разделитель,
	|	ТаблицаПоказанияПриборовУчета.ТекущиеПоказания КАК Показание,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	|	ЛОЖЬ КАК КС,
	|	ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.ПустаяСсылка) КАК ИсточникПоказаний,
	|	ЛОЖЬ КАК Переворот,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаПоказанияПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Состояние КАК Состояние,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		ТаблицаШкалы.IDСтроки КАК IDСтроки,
	|		ТаблицаШкалы.Шкала КАК Шкала
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(Шапка.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ Шапка.Дата
	|			КОНЕЦ КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.КлючПомещения КАК КлючПомещения,
	|			ТаблицаТочки.ТочкаУчета КАК ТочкаУчета,
	|			ТаблицаТочки.ПриборУчета КАК ПриборУчета,
	|			ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			Шапка.ПериодНачисления КАК ПериодНачисления,
	|			ТаблицаТочки.IDСтроки КАК IDСтрокиТочкиУчета,
	|			Шапка.Ссылка КАК Регистратор
	|		ИЗ
	|			Документ.энргУстановитьДатуПоверкиПУ КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДатуПоверкиПУ.ТочкиУчета КАК ТаблицаТочки
	|				ПО Шапка.Ссылка = ТаблицаТочки.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (ТаблицаТочки.Ссылка В (&мДокументы))
	|					И (НЕ ТаблицаТочки.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДатуПоверкиПУ.ШкалыПриборовУчета КАК ТаблицаШкалы
	|			ПО ВложенныйЗапрос.Регистратор = ТаблицаШкалы.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = ТаблицаШкалы.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДатуПоверкиПУ.ПоказанияПриборовУчета КАК ТаблицаПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = ТаблицаПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанияПриборовУчета.IDСтроки"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаДатыПоверкиПрибораУчета(Схема, Регистры)
	
	ИмяРегистра = "энргДатыПоверкиПрибораУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ФактическаяДатаПоверки КАК ФактическаяДатаПоверки,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ДатаОчереднойПоверки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВложенныйЗапрос.ФактическаяДатаПоверки
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВложенныйЗапрос.ДатаОчереднойПоверки, ГОД, ЕСТЬNULL(энргМаркиПриборовУчета.МежповерочныйИнтервал * -1, 0))
	|	КОНЕЦ КАК ДатаПоверки,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.КлючПомещения КАК КлючПомещения,
	|		ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаТочек.ПриборУчета КАК ПриборУчета,
	|		ТаблицаТочек.ДатаПоверкиСчетчика КАК ФактическаяДатаПоверки,
	|		ТаблицаТочек.ДатаОчереднойПоверки КАК ДатаОчереднойПоверки,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		Шапка.ПериодНачисления КАК ПериодНачисления,
	|		энргПриборыУчетаАбонента.ТипПрибораУчета КАК ТипПрибораУчета
	|	ИЗ
	|		Документ.энргУстановитьДатуПоверкиПУ КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДатуПоверкиПУ.ТочкиУчета КАК ТаблицаТочек
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|				ПО ТаблицаТочек.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|			ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (ТаблицаТочек.Ссылка В (&мДокументы))
	|				И (НЕ ТаблицаТочек.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргМаркиПриборовУчета КАК энргМаркиПриборовУчета
	|			ПО энргТипыПриборовУчета.МаркаПУ = энргМаркиПриборовУчета.Ссылка
	|		ПО ВложенныйЗапрос.ТипПрибораУчета = энргТипыПриборовУчета.Ссылка";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеВыполненияОбязанностейГарантирующегоПоставщика(Схема, Регистры)
		
	ИмяРегистра = "энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	=
	"ВЫБРАТЬ
	|	табШапка.Дата КАК Период,
	|	табШапка.Организация КАК Организация,
	|	табШапка.Район КАК Район,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	&Строение КАК Строение,
	|	&Помещение КАК Помещение,
	|	табШапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табШапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	ИСТИНА КАК ОбязанностиВыполнены
	|ИЗ
	|	Документ.энргУстановитьДатуПоверкиПУ КАК табШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДатуПоверкиПУ.ТочкиУчета КАК ТаблицаТочкиУчета
	|		ПО (табШапка.Ссылка В (&мДокументы))
	|			И табШапка.Ссылка = ТаблицаТочкиУчета.Ссылка";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПриборыУчетаСИстекшимСрокомПоверки(Схема, Регистры)
		
	ИмяРегистра = "энргПриборыУчетаСИстекшимСрокомПоверки";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	=
	"ВЫБРАТЬ
	|	табШапка.Дата КАК Период,
	|	табШапка.Организация КАК Организация,
	|	табШапка.Район КАК Район,
	|	табШапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаТочкиУчета.ДатаОчереднойПоверки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ТаблицаТочкиУчета.ДатаПоверкиСчетчика
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ТаблицаТочкиУчета.ДатаОчереднойПоверки, ГОД, ЕСТЬNULL(ТаблицаТочкиУчета.ПриборУчета.ТипПрибораУчета.МаркаПУ.МежповерочныйИнтервал * -1, 0))
	|	КОНЕЦ КАК ДатаПоверки,
	|	ИСТИНА КАК ПоверкаВыполнена,
	|	табШапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	Документ.энргУстановитьДатуПоверкиПУ КАК табШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДатуПоверкиПУ.ТочкиУчета КАК ТаблицаТочкиУчета
	|		ПО (табШапка.Ссылка В (&мДокументы))
	|			И табШапка.Ссылка = ТаблицаТочкиУчета.Ссылка";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтрейфеса_КонтрольПроведения

Процедура ДобавитьТекстЗапросаПараметрыКонтроля(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		=
	"ВЫБРАТЬ
	|	энргУстановитьДатуПоверкиПУ.Ссылка КАК Ссылка,
	|	энргУстановитьДатуПоверкиПУ.Организация КАК Организация,
	|	энргУстановитьДатуПоверкиПУ.Район КАК Район,
	|	энргУстановитьДатуПоверкиПУ.Абонент КАК Абонент,
	|	ВЫБОР
	|		КОГДА &ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.пустаяСсылка)
	|		ИНАЧЕ &Строение
	|	КОНЕЦ КАК МКД,
	|	ВЫБОР
	|		КОГДА НЕ энргУстановитьДатуПоверкиПУ.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргУстановитьДатуПоверкиПУ.ДатаФактическогоСобытия
	|		ИНАЧЕ энргУстановитьДатуПоверкиПУ.Дата
	|	КОНЕЦ КАК Период
	|ПОМЕСТИТЬ ПараметрыКонтроля
	|ИЗ
	|	Документ.энргУстановитьДатуПоверкиПУ КАК энргУстановитьДатуПоверкиПУ
	|ГДЕ
	|	энргУстановитьДатуПоверкиПУ.Ссылка В(&мДокументы)";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКонтрольСостояниеЛицевогоСчета(Схема)
	
	ПараметрыСостоянияМКД 		= Новый Структура;
	ПараметрыВременнойТаблицы 	= Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(Новый Структура("ИмяПараметра, ТаблицаИсточник, ТипПараметра, СоотвествиеПолей","ПараметрыКонтроля","ПараметрыКонтроля","ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,Абонент","Организация","Район","Абонент")));
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеЛС.СостояниеЛицевогоСчета(Схема,ПараметрыСостоянияМКД,"СостояниеЛицевогоСчета");
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПараметрыКонтроля.Ссылка) КАК ПредставлениеОбъекта,
	|	&ТекстСообщенияЛицевойСчетЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеЛицевогоСчета КАК СостояниеЛицевогоСчета
	|		ПО ПараметрыКонтроля.Организация = СостояниеЛицевогоСчета.Организация
	|			И ПараметрыКонтроля.Район = СостояниеЛицевогоСчета.Район
	|			И ПараметрыКонтроля.Абонент = СостояниеЛицевогоСчета.Абонент
	|ГДЕ
	|	НЕ ПараметрыКонтроля.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|	И (НЕ ЕСТЬNULL(СостояниеЛицевогоСчета.Состояние, ЛОЖЬ)
	|			ИЛИ ПараметрыКонтроля.Период < ЕСТЬNULL(СостояниеЛицевогоСчета.Период, ДАТАВРЕМЯ(1, 1, 1)))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 			= "КонтрольСостояниеЛС";
	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтерфейса_РаботаСоСтабильнымиПериодыми

Функция ТекстДляПроведенияПоСтабильнымПериодамУстановитьДатуПоверкиПУ()
	
	Текст  = 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочкиУчета.ДатаПоверкиСчетчика КАК ДатаПоверки,
	|	Шапка.Дата КАК ДатаРегистрацииПоверки,
	|	ЗНАЧЕНИЕ(Перечисление.энргвидыопераций.энргУстановитьДатуПоверкиПУ_ИндивидуальныйВвод) КАК ВидОперации
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДатуПоверкиПУ.ТочкиУчета КАК ТаблицаТочкиУчета
	|		ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочкиУчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДатуПоверкиПУ КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения";
	Возврат Текст;
	
КонецФункции

Функция ТекстДляПроведенияПоСтабильнымПериодамУстановитьДатуПоверкиПУСвязанныеПомещения()
	
	Текст  = 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ЗНАЧЕНИЕ(Перечисление.энргвидыопераций.энргУстановитьДатуПоверкиПУ_СвязанныеПомещения) КАК ВидОперации
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДатуПоверкиПУ.ТочкиУчета КАК ТаблицаТочкиУчета
	|		ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочкиУчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьДатуПоверкиПУ КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И ДокументыДляПроведения.КлючПомещения <> Шапка.КлючПомещения";
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
